# Introduction

- Normally, we would be doing our querying in a DBMS, but for the sake of showcasing, SQL queries on this database will be done in Jupyter Labs
- To run SQL queries in Jupyter, we have to add %%sql on its own line to the start of our query.
- We'll be doing this for every query we make, and are using jupyter for reproducability.

## Connecting to database and installing necessary packages

In [1]:
# import necessary packages
import pandas as pd
import sqlite3

In [2]:
# This is the workflow for working with SQL in python. You have to:
# establish a connection to the database
# instantiate a cursor class to "navigate" the database
# execute queries on the database using the cursor, combining SQL and python to do so.

conn = sqlite3.connect("factbook.db")
q1 = "SELECT * FROM sqlite_master WHERE type='table';"
r = conn.cursor()

# turning the results of every query into a pandas dataframe makes it more readable.
pd.read_sql_query(q1, conn)

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

# Overview of the Data

In [3]:
# let's take a look at the first five rows of the db to get acquainted.
# from the code above, we know the table is called 'facts'
q2 = 'SELECT * FROM facts limit 5;'

pd.read_sql_query(q2,conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

In [8]:
# let's take a look at MIN AND MAX for population and growth to start
q3 = '''
SELECT 
MIN(population) min_pop,
MAX(population) max_pop,
MIN(population_growth) min_pop_growth,
MAX(population_growth) max_pop_growth
FROM facts;
'''
pd.read_sql_query(q3, conn)

   min_pop     max_pop  min_pop_growth  max_pop_growth
0        0  7256490011             0.0            4.02

there's a country with a population of 0 and another with more than 7.2 billion people. That seems off. We'll investigate

In [35]:
q4 = '''
SELECT * 
FROM facts
WHERE population == (
    SELECT MIN(population) 
    FROM facts);
'''
pd.read_sql_query(q4, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,250,ay,Antarctica,None,280000,None,0,None,None,None,None

Okay. Antarctica. That's fair. What about the country with the mega population?

In [37]:
q5 = '''
SELECT *
FROM facts
WHERE population == (
    SELECT MAX(population)
    FROM facts);
'''
pd.read_sql_query(q5, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,261,xx,World,None,None,None,7256490011,1.08,18.6,7.8,None

Ah. Well the world has its own country code. This would actually be a good baseline to determine which countries fall above and below the world average for each category

In [39]:
# how many countries are there?
q6 = '''
SELECT COUNT(*)
FROM facts
'''
pd.read_sql_query(q6, conn)

   COUNT(*)
0       261

In [64]:
# of these 261, how many are below the average death rate for this data?
# we returned a table of 124 rows. 47% of countries have a lower death rate than the average.
q6 = '''
SELECT *
FROM facts
WHERE death_rate < (SELECT AVG(death_rate) FROM facts)
ORDER BY death_rate;
'''
pd.read_sql_query(q6, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,141,qa,Qatar,11586.0,11586.0,0.0,2194817,3.07,9.84,1.53,22.39
1,184,ae,United Arab Emirates,83600.0,83600.0,0.0,5779760,2.58,15.43,1.97,12.36
2,93,ku,Kuwait,17818.0,17818.0,0.0,2788534,1.62,19.91,2.18,1.58
3,13,ba,Bahrain,760.0,760.0,0.0,1346613,2.41,13.66,2.69,13.09
4,251,gz,Gaza Strip,360.0,360.0,0.0,1869055,2.81,31.11,3.04,0.00
5,241,tk,Turks and Caicos Islands,948.0,948.0,0.0,50280,2.30,16.13,3.10,9.94
6,151,sa,Saudi Arabia,2149690.0,2149690.0,0.0,27752316,1.46,18.51,3.33,0.55
7,131,mu,Oman,309500.0,309500.0,0.0,3286936,2.07,24.44,3.36,0.43
8,156,sn,Singapore,697.0,687.0,10.0,5674472,1.89,8.27,3.43,14.05
9,254,we,West Bank,5860.0,5640.0,220.0,2785366,1.95,22.99,3.50,0.00
10,25,bx,Brunei,5765.0,5265.0,500.0,429646,1.62,17.32,3.52,2.43
11,100,ly,Libya,1759540.0,1759540.0,0.0,6411776,2.23,18.03,3.58,7.80
12,245,cq,Northern Mariana Islands,464.0,464.0,0.0,52344,2.18,18.32,3.71,7.16
13,80,iz,Iraq,438317.0,437367.0,950.0,37056169,2.93,31.45,3.77,1.62
14,86,jo,Jordan,89342.0,88802.0,540.0,8117564,0.83,25.37,3.79,13.24
15,159,bp,Solomon Islands,28896.0,27986.0,910.0,622469,2.02,25.77,3.85,1.75
16,108,mv,Maldives,298.0,298.0,0.0,393253,0.08,15.75,3.89,12.68
17,170,sy,Syria,185180.0,183630.0,1550.0,17064854,0.16,22.17,4.00,19.79
18,189,nh,Vanuatu,12189.0,12189.0,0.0,272264,1.95,25.04,4.09,1.47
19,111,rm,Marshall Islands,181.0,181.0,0.0,72191,1.66,25.60,4.21,4.83
20,205,mc,Macau,28.0,28.0,0.0,592731,0.80,8.88,4.22,3.37
21,115,fm,"Micronesia, Federated States of",702.0,702.0,0.0,105216,0.46,20.54,4.23,20.93
22,3,ag,Algeria,2381741.0,2381741.0,0.0,39542166,1.84,23.67,4.31,0.92
23,218,sk,Sint Maarten,34.0,34.0,0.0,39689,1.51,13.00,4.51,6.63
24,42,cs,Costa Rica,51100.0,51060.0,40.0,4814144,1.22,15.91,4.55,0.83
25,51,dr,Dominican Republic,48670.0,48320.0,350.0,10478756,1.23,18.73,4.55,1.91
26,226,av,Anguilla,91.0,91.0,0.0,16418,2.03,12.67,4.57,12.18
27,136,pa,Paraguay,406752.0,397302.0,9450.0,6783272,1.16,16.37,4.68,0.07
28,242,aq,American Samoa,199.0,199.0,0.0,54343,0.30,22.89,4.75,21.13
29,53,eg,Egypt,1001450.0,995450.0,6000.0,88487396,1.79,22.90,4.77,0.19
...,...,...,...,...,...,...,...,...,...,...,...
94,11,aj,Azerbaijan,86600.0,82629.0,3971.0,9780780,0.96,16.64,7.07,0.00
95,204,hk,Hong Kong,1108.0,1073.0,35.0,7141106,0.38,9.23,7.07,1.68
96,145,sc,Saint Kitts and Nevis,261.0,261.0,0.0,51936,0.76,13.50,7.09,1.21
97,196,tw,Taiwan,35980.0,32260.0,3720.0,23415126,0.23,8.47,7.11,0.89
98,89,kr,Kiribati,811.0,811.0,0.0,105711,1.15,21.46,7.12,2.87
99,101,ls,Liechtenstein,160.0,160.0,0.0,37624,0.84,10.45,7.12,5.08
100,9,as,Australia,7741220.0,7682300.0,58920.0,22751014,1.07,12.15,7.14,5.65
101,63,ga,"Gambia, The",11300.0,10120.0,1180.0,1967709,2.16,30.86,7.15,2.12
102,147,vc,Saint Vincent and the Grenadines,389.0,389.0,0.0,102627,0.28,13.57,7.18,9.17
103,66,gh,Ghana,238533.0,227533.0,11000.0,26327649,2.18,31.09,7.22,2.02
104,103,lu,Luxembourg,2586.0,2586.0,0.0,570252,2.13,11.37,7.24,17.16
105,150,tp,Sao Tome and Principe,964.0,964.0,0.0,194006,1.84,34.23,7.24,8.63
106,175,to,Togo,56785.0,54385.0,2400.0,7552318,2.69,34.13,7.26,0.00
107,72,gy,Guyana,214969.0,196849.0,18120.0,735222,0.02,15.59,7.32,8.06
108,77,in,India,3287263.0,2973193.0,314070.0,1251695584,1.22,19.55,7.32,0.04
109,7,ar,Argentina,2780400.0,2736690.0,43710.0,43431886,0.93,16.64,7.33,0.00
110,126,nz,New Zealand,267710.0,267710.0,NaN,4438393,0.82,13.33,7.36,2.21
111,146,st,Saint Lucia,616.0,606.0,10.0,163922,0.34,13.70,7.42,2.93
112,239,sh,"Saint Helena, Ascension, and Tristan da Cunha",308.0,122.0,0.0,7795,0.24,9.88,7.44,0.00
113,56,er,Eritrea,117600.0,101000.0,16600.0,6527689,2.25,30.00,7.52,0.00
114,37,ch,China,9596960.0,9326410.0,270550.0,1367485388,0.45,12.49,7.53,0.44
115,39,cn,Comoros,2235.0,2235.0,0.0,780971,1.77,27.84,7.57,2.53
116,95,la,Laos,236800.0,230800.0,6000.0,6911544,1.55,24.25,7.63,1.09
117,165,su,Sudan,1861484.0,NaN,NaN,36108853,1.72,29.19,7.66,4.29
118,30,cb,Cambodia,181035.0,176515.0,4520.0,15708756,1.58,23.83,7.68,0.32
119,235,je,Jersey,116.0,116.0,0.0,97294,0.80,11.91,7.68,3.76
120,45,cu,Cuba,110860.0,109820.0,1040.0,11031433,0.15,9.90,7.72,3.66
121,49,dj,Djibouti,23200.0,23180.0,20.0,828324,2.20,23.65,7.73,6.06
122,173,th,Thailand,513120.0,510890.0,2230.0,67976405,0.34,11.19,7.80,0.00
123,261,xx,World,NaN,NaN,NaN,7256490011,1.08,18.60,7.80,NaN

In [12]:
# what about the countries with the highest death_rate?
q6 = '''
SELECT *
FROM facts
ORDER BY death_rate DESC
LIMIT 5;
'''
pd.read_sql_query(q6, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,98,lt,Lesotho,30355,30355,0,1947701,0.32,25.47,14.89,7.36
1,183,up,Ukraine,603550,579330,24220,44429471,0.60,10.72,14.46,2.25
2,26,bu,Bulgaria,110879,108489,2390,7186893,0.58,8.92,14.44,0.29
3,71,pu,Guinea-Bissau,36125,28120,8005,1726170,1.91,33.38,14.33,0.00
4,96,lg,Latvia,64589,62249,2340,1986705,1.06,10.00,14.31,6.26

These countries have the highest death_rate according to the CIA, we can create subqueries to learn more about these and similar countries with high death rates

In [17]:
# all of these countries have have a death rate above 14. Let's see how many have a death rate above 10
q7 ='''
SELECT *
FROM facts
WHERE death_rate > 10.00
ORDER BY population DESC
LIMIT 10
'''

pd.read_sql_query(q7, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,197,ee,European Union,4324782,NaN,NaN,513949445,0.25,10.20,10.20,2.50
1,129,ni,Nigeria,923768,910768.0,13000.0,181562056,2.45,37.64,12.90,0.22
2,143,rs,Russia,17098242,16377742.0,720500.0,142423773,0.04,11.60,13.69,1.69
3,65,gm,Germany,357022,348672.0,8350.0,80854408,0.17,8.47,11.42,1.24
4,40,cg,"Congo, Democratic Republic of the",2344858,2267048.0,77810.0,79375136,2.45,34.88,10.07,0.27
5,83,it,Italy,301340,294140.0,7200.0,61855120,0.27,8.74,10.19,4.10
6,183,up,Ukraine,603550,579330.0,24220.0,44429471,0.60,10.72,14.46,2.25
7,139,pl,Poland,312685,304255.0,8430.0,38562189,0.09,9.74,10.19,0.46
8,182,ug,Uganda,241038,197100.0,43938.0,37101745,3.24,43.79,10.69,0.74
9,1,af,Afghanistan,652230,652230.0,0.0,32564342,2.32,38.57,13.89,1.51

It's good that we're seeing the EU as part of this, that means we definitely have a data cleanliness issue. Outside of that, we can see that countries that tend to have this problem are in eastern Europe, the middle east, and northern and central Africa